ОфощнаяЛавка/src/Documents/ПродажаТоваров/ПродажаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаТоваров</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ОфощнаяЛавка/src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ОфощнаяЛавка/src/Documents/ПродажаТоваров/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиТоваров.Очистить();
	Движения.ОстаткиТоваров.Записать();
	
	// регистр ОстаткиТоваров Расход
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл 
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", ТекСтрокаТовары.Номенклатура); 
		
		Остатки = РегистрыНакопления.ОстаткиТоваров.Остатки(Дата, Отбор);  
		
		Если Остатки.Количество() = 0 Тогда		
			ТекстСообщения = СтрШаблон("Недостаточно товара %1. товара нет на складе", ТекСтрокаТовары.Номенклатура);
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = (ТекстСообщения);
			Сообщение.Сообщить(); 
			Отказ = Истина;
			Продолжить;  			
		КонецЕсли; 
		
		СтрокаОстатка = Остатки[0];
		Если СтрокаОстатка.Количество < ТекСтрокаТовары.Количество Тогда
			ТекстСообщения = СтрШаблон("Недостаточно товара %1. Не Хватает %2", ТекСтрокаТовары.Номенклатура, (ТекСтрокаТовары.Количество - СтрокаОстатка.Количество));
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = (ТекстСообщения);
			Сообщение.Сообщить();  
			Отказ = Истина;
			Продолжить;  			
		КонецЕсли; 
			
		СуммаКСписанию = 0; 
		
		Если ТекСтрокаТовары = СтрокаОстатка.Количество Тогда  
			СуммаКСписанию = СтрокаОстатка.Сумма;
		Иначе		
		СтоимостьЕдиницыТовара = СтрокаОстатка.Сумма / СтрокаОстатка.Количество; 
		СуммаКСписанию = СтоимостьЕдиницыТовара * ТекСтрокаТовары.Количество;  
	КонецЕсли;
		
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Сумма = СуммаКСписанию;
	КонецЦикла;  
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ("Проведен " + Ссылка);
	Сообщение.Сообщить(); 

КонецПроцедуры

#КонецОбласти
